type GroomingCosts = {
  [key: string]: { cost: Cost; caption: string };
};
type Cost = {
  [key: string]: number[];
};

export const GROOMING_COSTS: GroomingCosts = {
  소형견: {
    cost: {
      "~5kg": [2.5, 3.5, 4.0, 4.5, 6.5, 7.5],
      "~7kg": [3.0, 4.0, 4.5, 5.0, 7.0, 8.0],
      "~9kg": [3.5, 4.5, 5.0, 5.5, 7.5, 8.5],
    },
    caption:
      "말티즈, 토이푸들, 포메라니안, 시츄, 치와와, 요크셔테리어 등 / 사이즈 큰 소형종은 5천원 추가비용 발생",
  },
  중형견: {
    cost: {
      "~5kg": [3.0, 4.5, 5.0, 5.5, 7.5, 8.5],
      "~7kg": [3.5, 5.0, 5.5, 6.0, 8.0, 9.0],
      "~9kg": [4.0, 5.5, 6.0, 6.5, 8.5, 9.5],
      "~11kg": [4.5, 6.0, 6.5, 7.0, 9.0, 10.0],
      "~13kg": [5.0, 6.5, 7.0, 7.5, 9.5, 10.5],
      "~15kg": [5.5, 7.0, 7.5, 8.0, 10.0, 11.0],
    },
    caption: "스피츠, 슈나우져, 코카스파니엘, 웰시코기, 닥스훈트 믹스견 등",
  },
  특수견: {
    cost: {
      "~5kg": [3.5, 5.0, 5.5, 6.0, 8.5, 11.0],
      "~7kg": [4.0, 5.5, 6.0, 6.5, 9.5, 11.5],
      "~9kg": [4.5, 6.0, 6.5, 7.0, 10.5, 12.5],
      "~11kg": [5.0, 6.5, 7.0, 7.5, 11.5, 13.5],
      "~13kg": [5.5, 7.0, 7.5, 8.0, 12.5, 14.5],
      "~15kg": [6.0, 7.5, 8.0, 8.5, 13.5, 15.5],
    },
    caption: "비숑, 베를링턴, 꼬똥, 테리어 등",
  },
  고양이: {
    cost: {
      "~5kg": [1, 1],
    },
    caption: "털 엉킴, 사나움, 5kg 이상 몸무게시 추가 비용 발생할 수 있습니다",
  },
};
