export const QNAS = [
  {
    question: "내원 전 금식을 해야하나요?",
    answer: (
      <>
        혈액검사, 수술, 복부초음파의 경우 내워 8시간 ~ 12시간 전까지 금식을
        해주는 것이 좋습니다. <br />
        물의 경우 4시간 전까지는 마셔도 괜찮습니다.
      </>
    ),
  },
  {
    question: "검사 결과는 당일 알 수 있나요?",
    answer: (
      <>
        원내에 보유한 장비의 경우 30분내로 검사결과가 나옵니다.
        <br />
        외부 의뢰를 해야하는 검사의 경우 일주일 내로 검사결과를 받아보실 수
        있습니다.
      </>
    ),
  },
  {
    question: "주차가 가능한가요?",
    answer: <>병원 1층에 주차공간을 보유하고 있습니다.</>,
  },
  {
    question: "마취를 하면 위험하지 않나요?",
    answer: (
      <>
        마취는 수의과 의료에서 일반적으로 사용되는 프로세스 중 하나이며, 통제된
        환경에서 안전하게 수행될 수 있습니다. <br /> 그러나 개별 동물의 상태에
        따라 마취가 부적합 할 수 있으므로 마취전에는 반드시 마취전 검사를
        실시하고 있습니다.
      </>
    ),
  },
  {
    question: "마취를 했는데 밥은 언제부터 먹이나요?",
    answer: (
      <>
        마취 후 금식 기간과 음식 복귀에 대한 정확한 지침은 수의사에게 질문하거나
        받은 수술 후 진료 지침을 따라야 합니다. <br />
        개별 동물의 상태에 따라서도 다를 수 있기 때문에, 수의사의 지시를 따르는
        것이 중요합니다.
      </>
    ),
  },
  {
    question: "병원에서 아이가 너무 떨어요",
    answer: (
      <>
        병원에서 떠는 이유는 여러 가지 원인이 있을 수 있습니다.
        <br />
        틍증 반응, 저체온증 혹은 고체온증,
        <br /> 새로운 환경, 다른 동물들, 이상한 냄새와 소리, 등으로 인한
        스트레스가 원인 일 수 있습니다.
      </>
    ),
  },
  {
    question: "퇴원 후 집에서 잠만 자요, 문제가 있나요?",
    answer: (
      <>
        반려동물이 퇴원 후 집에서 잠만 자는 것은 일반적인 반응 중 하나일 수
        있습니다. 퇴원 후에 긴장이 풀리면서 피로감을 느낄 수 있습니다.
        <br /> 따라서 안정적인 휴식을 취하도록 하는 것이 좋습니다.
        <br /> 만약 1 ~ 2일 후에도 잠만자는 행동이 지속될 경우 수의사와 상담을
        하는 것이 좋습니다.
      </>
    ),
  },
  {
    question: "아이가 밥을 먹지 않는데 약을 먹여도 되나요?",
    answer: (
      <>
        반려동물이 음식을 먹지 않은 상태에서 약을 먹이는 것은 주의가 필요합니다.
        <br />
        약을 음식과 함께 복용하면 약물의 흡수가 더욱 부드럽게 이루어질 수 있으며
        소화 문제를 최소화할 수 있습니다. <br /> 그러나 약에 따라서는 반드시
        음식과 함께 복용해야 하는 경우와 음식을 먹지 않은 상태에서도 복용이
        가능한 경우가 있으므로 수의사와 상담을 하는 것이 좋습니다.
      </>
    ),
  },
  {
    question: "약을 먹고 바로 토했는데 약을 다시 먹여야 하나요?",
    answer: (
      <>
        만약 반려동물이 약을 먹은 후 토했다면, 다시 약을 먹이는 것은 주의가
        필요합니다. <br />
        일반적으로 약을 복용한 후 토하는 경우에는 약물이 충분히 흡수되지 않았을
        수 있습니다. 이 경우에는 다시 약을 먹이는 것이 좋습니다. 그러나 주의가
        필요한 약물들이 있으므로 수의사와 상담을 하는 것이 좋습니다.
      </>
    ),
  },
  {
    question: "아이가 너무 사나운데 진료를 볼 수 있나요?",
    answer: (
      <>
        너무 사나운 아이의 경우 주사 마취가 필요할 수 있습니다.
        <br />
        아니면 내원 전 진정제를 먹인 후 내원하는 방법도 있으므로 미리 수의사와
        상담을 하는 것이 좋습니다.
      </>
    ),
  },
  {
    question: "특수동물 진료범위가 어떻게 되나요?",
    answer: (
      <>
        조류, 양서류, 파충류, 토끼, 설치류, 라쿤 등 대부분의 특수동물의 진료가
        가능하나 전화로 문의해 주시면 정확한 답변이 가능합니다.
      </>
    ),
  },
];
